Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GA204.h
extern volatile PORTCBITS PORTCbits __attribute__((__sfr__));

#define LATC LATC
extern volatile unsigned int  LATC __attribute__((__sfr__));
typedef struct tagLATCBITS {
  unsigned LATC0:1;
  unsigned LATC1:1;
  unsigned LATC2:1;
  unsigned LATC3:1;
  unsigned LATC4:1;
  unsigned LATC5:1;
  unsigned LATC6:1;
  unsigned LATC7:1;
  unsigned LATC8:1;
  unsigned LATC9:1;
} LATCBITS;
extern volatile LATCBITS LATCbits __attribute__((__sfr__));

#define ODCC ODCC
extern volatile unsigned int  ODCC __attribute__((__sfr__));
typedef struct tagODCCBITS {
  unsigned ODC0:1;
  unsigned ODC1:1;
  unsigned ODC2:1;
  unsigned ODC3:1;
  unsigned ODC4:1;
  unsigned ODC5:1;
  unsigned ODC6:1;
  unsigned ODC7:1;
  unsigned ODC8:1;
  unsigned ODC9:1;
} ODCCBITS;
extern volatile ODCCBITS ODCCbits __attribute__((__sfr__));

#define ANSC ANSC
extern volatile unsigned int  ANSC __attribute__((__sfr__));
typedef struct tagANSCBITS {
  unsigned ANSC0:1;
  unsigned ANSC1:1;
  unsigned ANSC2:1;
} ANSCBITS;
extern volatile ANSCBITS ANSCbits __attribute__((__sfr__));

#define ANCFG ANCFG
extern volatile unsigned int  ANCFG __attribute__((__sfr__));
typedef struct tagANCFGBITS {
  unsigned VBGEN:1;
  unsigned VBG2EN:1;
} ANCFGBITS;
extern volatile ANCFGBITS ANCFGbits __attribute__((__sfr__));

#define PADCFG1 PADCFG1
extern volatile unsigned int  PADCFG1 __attribute__((__sfr__));
typedef struct tagPADCFG1BITS {
  unsigned PMPTTL:1;
} PADCFG1BITS;
extern volatile PADCFG1BITS PADCFG1bits __attribute__((__sfr__));

#define CRYCON1 CRYCON1
extern volatile unsigned int  CRYCON1 __attribute__((__sfr__));
__extension__ typedef struct tagCRYCON1BITS {
  union {
    struct {
      unsigned CPHRMOD:3;
      unsigned CPHRSEL:1;
      unsigned OPMOD:4;
      unsigned CRYGO:1;
      unsigned :1;
      unsigned FREEIE:1;
      unsigned DONEIE:1;
      unsigned ROLLIE:1;
      unsigned CRYSIDL:1;
      unsigned :1;
      unsigned CRYON:1;
    };
    struct {
      unsigned CPHRMOD0:1;
      unsigned CPHRMOD1:1;
      unsigned CPHRMOD2:1;
      unsigned :1;
      unsigned OPMOD0:1;
      unsigned OPMOD1:1;
      unsigned OPMOD2:1;
      unsigned OPMOD3:1;
    };
  };
} CRYCON1BITS;
extern volatile CRYCON1BITS CRYCON1bits __attribute__((__sfr__));

#define CRYCONL CRYCONL
extern volatile unsigned int  CRYCONL __attribute__((__sfr__));
__extension__ typedef struct tagCRYCONLBITS {
  union {
    struct {
      unsigned CPHRMOD:3;
      unsigned CPHRSEL:1;
      unsigned OPMOD:4;
      unsigned CRYGO:1;
      unsigned :1;
      unsigned FREEIE:1;
      unsigned DONEIE:1;
      unsigned ROLLIE:1;
      unsigned CRYSIDL:1;
      unsigned :1;
      unsigned CRYON:1;
    };
    struct {
      unsigned CPHRMOD0:1;
      unsigned CPHRMOD1:1;
      unsigned CPHRMOD2:1;
      unsigned :1;
      unsigned OPMOD0:1;
      unsigned OPMOD1:1;
      unsigned OPMOD2:1;
      unsigned OPMOD3:1;
    };
  };
} CRYCONLBITS;
extern volatile CRYCONLBITS CRYCONLbits __attribute__((__sfr__));

#define CRYCON2 CRYCON2
extern volatile unsigned int  CRYCON2 __attribute__((__sfr__));
__extension__ typedef struct tagCRYCON2BITS {
  union {
    struct {
      unsigned KEYSRC:4;
      unsigned :1;
      unsigned KEYMOD:2;
      unsigned SKEYSEL:1;
      unsigned CTRSIZE:7;
    };
    struct {
      unsigned KEYSRC0:1;
      unsigned KEYSRC1:1;
      unsigned KEYSRC2:1;
      unsigned KEYSRC3:1;
      unsigned :1;
      unsigned KEYMOD0:1;
      unsigned KEYMOD1:1;
      unsigned :1;
      unsigned CTRSIZE0:1;
      unsigned CTRSIZE1:1;
      unsigned CTRSIZE2:1;
      unsigned CTRSIZE3:1;
      unsigned CTRSIZE4:1;
      unsigned CTRSIZE5:1;
      unsigned CTRSIZE6:1;
    };
  };
} CRYCON2BITS;
extern volatile CRYCON2BITS CRYCON2bits __attribute__((__sfr__));

#define CRYCONH CRYCONH
extern volatile unsigned int  CRYCONH __attribute__((__sfr__));
__extension__ typedef struct tagCRYCONHBITS {
  union {
    struct {
      unsigned KEYSRC:4;
      unsigned :1;
      unsigned KEYMOD:2;
      unsigned SKEYSEL:1;
      unsigned CTRSIZE:7;
    };
    struct {
      unsigned KEYSRC0:1;
      unsigned KEYSRC1:1;
      unsigned KEYSRC2:1;
      unsigned KEYSRC3:1;
      unsigned :1;
      unsigned KEYMOD0:1;
      unsigned KEYMOD1:1;
      unsigned :1;
      unsigned CTRSIZE0:1;
      unsigned CTRSIZE1:1;
      unsigned CTRSIZE2:1;
      unsigned CTRSIZE3:1;
      unsigned CTRSIZE4:1;
      unsigned CTRSIZE5:1;
      unsigned CTRSIZE6:1;
    };
  };
} CRYCONHBITS;
extern volatile CRYCONHBITS CRYCONHbits __attribute__((__sfr__));

#define CRYSTAT CRYSTAT
extern volatile unsigned int  CRYSTAT __attribute__((__sfr__));
typedef struct tagCRYSTATBITS {
  unsigned PGMFAIL:1;
  unsigned KEYFAIL:1;
  unsigned MODFAIL:1;
  unsigned :1;
  unsigned ROLLOVR:1;
  unsigned CRYABRT:1;
  unsigned TXTABSY:1;
  unsigned CRYBSY:1;
} CRYSTATBITS;
extern volatile CRYSTATBITS CRYSTATbits __attribute__((__sfr__));

#define CRYOTP CRYOTP
extern volatile unsigned int  CRYOTP __attribute__((__sfr__));
__extension__ typedef struct tagCRYOTPBITS {
  union {
    struct {
      unsigned CRYWR:1;
      unsigned KEYPG:4;
      unsigned CRYREAD:1;
      unsigned OTPIE:1;
      unsigned PGMTST:1;
    };
    struct {
      unsigned :1;
      unsigned KEYPG0:1;
      unsigned KEYPG1:1;
      unsigned KEYPG2:1;
      unsigned KEYPG3:1;
    };
  };
} CRYOTPBITS;
extern volatile CRYOTPBITS CRYOTPbits __attribute__((__sfr__));

#define CRYTXTA CRYTXTA
extern volatile unsigned int  CRYTXTA __attribute__((__sfr__));
#define CRYTXTA0 CRYTXTA0
extern volatile unsigned int  CRYTXTA0 __attribute__((__sfr__));
#define CRYTXTA1 CRYTXTA1
extern volatile unsigned int  CRYTXTA1 __attribute__((__sfr__));
#define CRYTXTA2 CRYTXTA2
extern volatile unsigned int  CRYTXTA2 __attribute__((__sfr__));
#define CRYTXTA3 CRYTXTA3
extern volatile unsigned int  CRYTXTA3 __attribute__((__sfr__));
#define CRYTXTA4 CRYTXTA4
extern volatile unsigned int  CRYTXTA4 __attribute__((__sfr__));
#define CRYTXTA5 CRYTXTA5
extern volatile unsigned int  CRYTXTA5 __attribute__((__sfr__));
#define CRYTXTA6 CRYTXTA6
extern volatile unsigned int  CRYTXTA6 __attribute__((__sfr__));
#define CRYTXTA7 CRYTXTA7
extern volatile unsigned int  CRYTXTA7 __attribute__((__sfr__));
#define CRYKEY CRYKEY
extern volatile unsigned int  CRYKEY __attribute__((__sfr__));
#define CRYKEY0 CRYKEY0
extern volatile unsigned int  CRYKEY0 __attribute__((__sfr__));
#define CRYKEY1 CRYKEY1
extern volatile unsigned int  CRYKEY1 __attribute__((__sfr__));
#define CRYKEY2 CRYKEY2
extern volatile unsigned int  CRYKEY2 __attribute__((__sfr__));
#define CRYKEY3 CRYKEY3
extern volatile unsigned int  CRYKEY3 __attribute__((__sfr__));
#define CRYKEY4 CRYKEY4
extern volatile unsigned int  CRYKEY4 __attribute__((__sfr__));
#define CRYKEY5 CRYKEY5
extern volatile unsigned int  CRYKEY5 __attribute__((__sfr__));
#define CRYKEY6 CRYKEY6
extern volatile unsigned int  CRYKEY6 __attribute__((__sfr__));
#define CRYKEY7 CRYKEY7
extern volatile unsigned int  CRYKEY7 __attribute__((__sfr__));
#define CRYKEY8 CRYKEY8
extern volatile unsigned int  CRYKEY8 __attribute__((__sfr__));
#define CRYKEY9 CRYKEY9
extern volatile unsigned int  CRYKEY9 __attribute__((__sfr__));
#define CRYKEY10 CRYKEY10
extern volatile unsigned int  CRYKEY10 __attribute__((__sfr__));
#define CRYKEY11 CRYKEY11
extern volatile unsigned int  CRYKEY11 __attribute__((__sfr__));
#define CRYKEY12 CRYKEY12
extern volatile unsigned int  CRYKEY12 __attribute__((__sfr__));
#define CRYKEY13 CRYKEY13
extern volatile unsigned int  CRYKEY13 __attribute__((__sfr__));
#define CRYKEY14 CRYKEY14
extern volatile unsigned int  CRYKEY14 __attribute__((__sfr__));
#define CRYKEY15 CRYKEY15
extern volatile unsigned int  CRYKEY15 __attribute__((__sfr__));
#define CRYTXTB CRYTXTB
extern volatile unsigned int  CRYTXTB __attribute__((__sfr__));
#define CRYTXTB0 CRYTXTB0
extern volatile unsigned int  CRYTXTB0 __attribute__((__sfr__));
#define CRYTXTB1 CRYTXTB1
extern volatile unsigned int  CRYTXTB1 __attribute__((__sfr__));
#define CRYTXTB2 CRYTXTB2
extern volatile unsigned int  CRYTXTB2 __attribute__((__sfr__));
#define CRYTXTB3 CRYTXTB3
extern volatile unsigned int  CRYTXTB3 __attribute__((__sfr__));
#define CRYTXTB4 CRYTXTB4
extern volatile unsigned int  CRYTXTB4 __attribute__((__sfr__));
#define CRYTXTB5 CRYTXTB5
extern volatile unsigned int  CRYTXTB5 __attribute__((__sfr__));
#define CRYTXTB6 CRYTXTB6
extern volatile unsigned int  CRYTXTB6 __attribute__((__sfr__));
#define CRYTXTB7 CRYTXTB7
extern volatile unsigned int  CRYTXTB7 __attribute__((__sfr__));
#define CRYTXTC CRYTXTC
extern volatile unsigned int  CRYTXTC __attribute__((__sfr__));
#define CRYTXTC0 CRYTXTC0
extern volatile unsigned int  CRYTXTC0 __attribute__((__sfr__));
#define CRYTXTC1 CRYTXTC1
extern volatile unsigned int  CRYTXTC1 __attribute__((__sfr__));
#define CRYTXTC2 CRYTXTC2
extern volatile unsigned int  CRYTXTC2 __attribute__((__sfr__));
#define CRYTXTC3 CRYTXTC3
extern volatile unsigned int  CRYTXTC3 __attribute__((__sfr__));
#define CRYTXTC4 CRYTXTC4
extern volatile unsigned int  CRYTXTC4 __attribute__((__sfr__));
#define CRYTXTC5 CRYTXTC5
extern volatile unsigned int  CRYTXTC5 __attribute__((__sfr__));
#define CRYTXTC6 CRYTXTC6
extern volatile unsigned int  CRYTXTC6 __attribute__((__sfr__));
#define CRYTXTC7 CRYTXTC7
extern volatile unsigned int  CRYTXTC7 __attribute__((__sfr__));
#define ADC1BUF0 ADC1BUF0
extern volatile unsigned int  ADC1BUF0 __attribute__((__sfr__));
#define ADC1BUF1 ADC1BUF1
extern volatile unsigned int  ADC1BUF1 __attribute__((__sfr__));
#define ADC1BUF2 ADC1BUF2
extern volatile unsigned int  ADC1BUF2 __attribute__((__sfr__));
#define ADC1BUF3 ADC1BUF3
extern volatile unsigned int  ADC1BUF3 __attribute__((__sfr__));
#define ADC1BUF4 ADC1BUF4
extern volatile unsigned int  ADC1BUF4 __attribute__((__sfr__));
#define ADC1BUF5 ADC1BUF5
extern volatile unsigned int  ADC1BUF5 __attribute__((__sfr__));
#define ADC1BUF6 ADC1BUF6
extern volatile unsigned int  ADC1BUF6 __attribute__((__sfr__));
#define ADC1BUF7 ADC1BUF7
extern volatile unsigned int  ADC1BUF7 __attribute__((__sfr__));
#define ADC1BUF8 ADC1BUF8
extern volatile unsigned int  ADC1BUF8 __attribute__((__sfr__));
#define ADC1BUF9 ADC1BUF9
extern volatile unsigned int  ADC1BUF9 __attribute__((__sfr__));
#define ADC1BUF10 ADC1BUF10
extern volatile unsigned int  ADC1BUF10 __attribute__((__sfr__));
#define ADC1BUF11 ADC1BUF11
extern volatile unsigned int  ADC1BUF11 __attribute__((__sfr__));
#define ADC1BUF12 ADC1BUF12
extern volatile unsigned int  ADC1BUF12 __attribute__((__sfr__));
#define ADC1BUF13 ADC1BUF13
extern volatile unsigned int  ADC1BUF13 __attribute__((__sfr__));
#define ADC1BUF14 ADC1BUF14
extern volatile unsigned int  ADC1BUF14 __attribute__((__sfr__));
#define ADC1BUF15 ADC1BUF15
extern volatile unsigned int  ADC1BUF15 __attribute__((__sfr__));
#define AD1CON1 AD1CON1
extern volatile unsigned int  AD1CON1 __attribute__((__sfr__));
__extension__ typedef struct tagAD1CON1BITS {
  union {
    struct {
      unsigned DONE:1;
      unsigned SAMP:1;
      unsigned ASAM:1;
      unsigned :1;
      unsigned SSRC:4;
      unsigned FORM:2;
      unsigned MODE12:1;
      unsigned DMAEN:1;
      unsigned DMABM:1;
      unsigned ADSIDL:1;
      unsigned :1;
      unsigned ADON:1;
    };
    struct {
      unsigned :4;
      unsigned SSRC0:1;
      unsigned SSRC1:1;
      unsigned SSRC2:1;
      unsigned SSRC3:1;
      unsigned FORM0:1;
      unsigned FORM1:1;
    };
  };
} AD1CON1BITS;
extern volatile AD1CON1BITS AD1CON1bits __attribute__((__sfr__));

#define AD1CON2 AD1CON2
extern volatile unsigned int  AD1CON2 __attribute__((__sfr__));
__extension__ typedef struct tagAD1CON2BITS {
  union {
    struct {
      unsigned ALTS:1;
      unsigned BUFM:1;
      unsigned SMPI:5;
      unsigned BUFS:1;
      unsigned :2;
      unsigned CSCNA:1;
      unsigned BUFREGEN:1;
      unsigned OFFCAL:1;
      unsigned NVCFG0:1;
      unsigned PVCFG:2;
    };
    struct {
      unsigned :2;
      unsigned SMPI0:1;
      unsigned SMPI1:1;
      unsigned SMPI2:1;
      unsigned SMPI3:1;
      unsigned SMPI4:1;
      unsigned :7;
      unsigned PCVFG0:1;
      unsigned PCVFG1:1;
    };
  };
} AD1CON2BITS;
extern volatile AD1CON2BITS AD1CON2bits __attribute__((__sfr__));

#define AD1CON3 AD1CON3
extern volatile unsigned int  AD1CON3 __attribute__((__sfr__));
__extension__ typedef struct tagAD1CON3BITS {
  union {
    struct {
      unsigned ADCS:8;
      unsigned SAMC:5;
      unsigned PUMPEN:1;
      unsigned EXTSAM:1;
      unsigned ADRC:1;
    };
    struct {
      unsigned ADCS0:1;
      unsigned ADCS1:1;
      unsigned ADCS2:1;
      unsigned ADCS3:1;
      unsigned ADCS4:1;
      unsigned ADCS5:1;
      unsigned ADCS6:1;
      unsigned ADCS7:1;
      unsigned SAMC0:1;
      unsigned SAMC1:1;
      unsigned SAMC2:1;
      unsigned SAMC3:1;
      unsigned SAMC4:1;
    };
  };
} AD1CON3BITS;
extern volatile AD1CON3BITS AD1CON3bits __attribute__((__sfr__));

#define AD1CHS AD1CHS
extern volatile unsigned int  AD1CHS __attribute__((__sfr__));
__extension__ typedef struct tagAD1CHSBITS {
  union {
    struct {
      unsigned CH0SA:5;
      unsigned CH0NA:3;
      unsigned CH0SB:5;
      unsigned CH0NB:3;
    };
    struct {
      unsigned CH0SA0:1;
      unsigned CH0SA1:1;
      unsigned CH0SA2:1;
      unsigned CH0SA3:1;
      unsigned CH0SA4:1;
      unsigned CH0NA0:1;
      unsigned CH0NA1:1;
      unsigned CH0NA2:1;
      unsigned CH0SB0:1;
      unsigned CH0SB1:1;
      unsigned CH0SB2:1;
      unsigned CH0SB3:1;
      unsigned CH0SB4:1;
      unsigned CH0NB0:1;
      unsigned CH0NB1:1;
      unsigned CH0NB2:1;
    };
  };
} AD1CHSBITS;
extern volatile AD1CHSBITS AD1CHSbits __attribute__((__sfr__));

#define AD1CHS0 AD1CHS0
extern volatile unsigned int  AD1CHS0 __attribute__((__sfr__));
__extension__ typedef struct tagAD1CHS0BITS {
  union {
    struct {
      unsigned CH0SA:5;
      unsigned CH0NA:3;
      unsigned CH0SB:5;
      unsigned CH0NB:3;
    };
    struct {
      unsigned CH0SA0:1;
      unsigned CH0SA1:1;
      unsigned CH0SA2:1;
      unsigned CH0SA3:1;
      unsigned CH0SA4:1;
      unsigned CH0NA0:1;
      unsigned CH0NA1:1;
      unsigned CH0NA2:1;
      unsigned CH0SB0:1;
      unsigned CH0SB1:1;
      unsigned CH0SB2:1;
      unsigned CH0SB3:1;
      unsigned CH0SB4:1;
      unsigned CH0NB0:1;
      unsigned CH0NB1:1;
      unsigned CH0NB2:1;
    };
  };
} AD1CHS0BITS;
extern volatile AD1CHS0BITS AD1CHS0bits __attribute__((__sfr__));

#define AD1CSSH AD1CSSH
extern volatile unsigned int  AD1CSSH __attribute__((__sfr__));
typedef struct tagAD1CSSHBITS {
  unsigned :11;
  unsigned CSS27:1;
  unsigned CSS28:1;
  unsigned CSS29:1;
  unsigned CSS30:1;
  unsigned CSS31:1;
} AD1CSSHBITS;
extern volatile AD1CSSHBITS AD1CSSHbits __attribute__((__sfr__));

#define AD1CSSL AD1CSSL
extern volatile unsigned int  AD1CSSL __attribute__((__sfr__));
typedef struct tagAD1CSSLBITS {
  unsigned CSS0:1;
  unsigned CSS1:1;
  unsigned CSS2:1;
  unsigned CSS3:1;
  unsigned CSS4:1;
  unsigned CSS5:1;
  unsigned CSS6:1;
  unsigned CSS7:1;
  unsigned CSS8:1;
  unsigned CSS9:1;
  unsigned CSS10:1;
  unsigned CSS11:1;
  unsigned CSS12:1;
  unsigned CSS13:1;
  unsigned CSS14:1;
} AD1CSSLBITS;
