Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GA204.h
#define _SPI3CON2_FRMCNT2_POSITION               0x00000002
#define _SPI3CON2_FRMCNT2_MASK                   0x00000004
#define _SPI3CON2_FRMCNT2_LENGTH                 0x00000001

#define _SPI3CON2_AUDMOD0_POSITION               0x00000008
#define _SPI3CON2_AUDMOD0_MASK                   0x00000100
#define _SPI3CON2_AUDMOD0_LENGTH                 0x00000001

#define _SPI3CON2_AUDMOD1_POSITION               0x00000009
#define _SPI3CON2_AUDMOD1_MASK                   0x00000200
#define _SPI3CON2_AUDMOD1_LENGTH                 0x00000001

#define _SPI3CON2L_WLENGTH_POSITION              0x00000000
#define _SPI3CON2L_WLENGTH_MASK                  0x0000001F
#define _SPI3CON2L_WLENGTH_LENGTH                0x00000005

#define _SPI3CON3_WLENGTH_POSITION               0x00000000
#define _SPI3CON3_WLENGTH_MASK                   0x0000001F
#define _SPI3CON3_WLENGTH_LENGTH                 0x00000005

#define _SPI3STATL_SPIRBF_POSITION               0x00000000
#define _SPI3STATL_SPIRBF_MASK                   0x00000001
#define _SPI3STATL_SPIRBF_LENGTH                 0x00000001

#define _SPI3STATL_SPITBF_POSITION               0x00000001
#define _SPI3STATL_SPITBF_MASK                   0x00000002
#define _SPI3STATL_SPITBF_LENGTH                 0x00000001

#define _SPI3STATL_SPITBE_POSITION               0x00000003
#define _SPI3STATL_SPITBE_MASK                   0x00000008
#define _SPI3STATL_SPITBE_LENGTH                 0x00000001

#define _SPI3STATL_SPIRBE_POSITION               0x00000005
#define _SPI3STATL_SPIRBE_MASK                   0x00000020
#define _SPI3STATL_SPIRBE_LENGTH                 0x00000001

#define _SPI3STATL_SPIROV_POSITION               0x00000006
#define _SPI3STATL_SPIROV_MASK                   0x00000040
#define _SPI3STATL_SPIROV_LENGTH                 0x00000001

#define _SPI3STATL_SRMT_POSITION                 0x00000007
#define _SPI3STATL_SRMT_MASK                     0x00000080
#define _SPI3STATL_SRMT_LENGTH                   0x00000001

#define _SPI3STATL_SPITUR_POSITION               0x00000008
#define _SPI3STATL_SPITUR_MASK                   0x00000100
#define _SPI3STATL_SPITUR_LENGTH                 0x00000001

#define _SPI3STATL_SPIBUSY_POSITION              0x0000000B
#define _SPI3STATL_SPIBUSY_MASK                  0x00000800
#define _SPI3STATL_SPIBUSY_LENGTH                0x00000001

#define _SPI3STATL_FRMERR_POSITION               0x0000000C
#define _SPI3STATL_FRMERR_MASK                   0x00001000
#define _SPI3STATL_FRMERR_LENGTH                 0x00000001

#define _SPI3STATH_TXELM_POSITION                0x00000000
#define _SPI3STATH_TXELM_MASK                    0x0000003F
#define _SPI3STATH_TXELM_LENGTH                  0x00000006

#define _SPI3STATH_RXELM_POSITION                0x00000008
#define _SPI3STATH_RXELM_MASK                    0x00003F00
#define _SPI3STATH_RXELM_LENGTH                  0x00000006

#define _SPI3STATH_TXELM0_POSITION               0x00000000
#define _SPI3STATH_TXELM0_MASK                   0x00000001
#define _SPI3STATH_TXELM0_LENGTH                 0x00000001

#define _SPI3STATH_TXELM1_POSITION               0x00000001
#define _SPI3STATH_TXELM1_MASK                   0x00000002
#define _SPI3STATH_TXELM1_LENGTH                 0x00000001

#define _SPI3STATH_TXELM2_POSITION               0x00000002
#define _SPI3STATH_TXELM2_MASK                   0x00000004
#define _SPI3STATH_TXELM2_LENGTH                 0x00000001

#define _SPI3STATH_TXELM3_POSITION               0x00000003
#define _SPI3STATH_TXELM3_MASK                   0x00000008
#define _SPI3STATH_TXELM3_LENGTH                 0x00000001

#define _SPI3STATH_TXELM4_POSITION               0x00000004
#define _SPI3STATH_TXELM4_MASK                   0x00000010
#define _SPI3STATH_TXELM4_LENGTH                 0x00000001

#define _SPI3STATH_TXELM5_POSITION               0x00000005
#define _SPI3STATH_TXELM5_MASK                   0x00000020
#define _SPI3STATH_TXELM5_LENGTH                 0x00000001

#define _SPI3STATH_RXELM0_POSITION               0x00000008
#define _SPI3STATH_RXELM0_MASK                   0x00000100
#define _SPI3STATH_RXELM0_LENGTH                 0x00000001

#define _SPI3STATH_RXELM1_POSITION               0x00000009
#define _SPI3STATH_RXELM1_MASK                   0x00000200
#define _SPI3STATH_RXELM1_LENGTH                 0x00000001

#define _SPI3STATH_RXELM2_POSITION               0x0000000A
#define _SPI3STATH_RXELM2_MASK                   0x00000400
#define _SPI3STATH_RXELM2_LENGTH                 0x00000001

#define _SPI3STATH_RXELM3_POSITION               0x0000000B
#define _SPI3STATH_RXELM3_MASK                   0x00000800
#define _SPI3STATH_RXELM3_LENGTH                 0x00000001

#define _SPI3STATH_RXELM4_POSITION               0x0000000C
#define _SPI3STATH_RXELM4_MASK                   0x00001000
#define _SPI3STATH_RXELM4_LENGTH                 0x00000001

#define _SPI3STATH_RXELM5_POSITION               0x0000000D
#define _SPI3STATH_RXELM5_MASK                   0x00002000
#define _SPI3STATH_RXELM5_LENGTH                 0x00000001

#define _SPI3BUFL_SPI3BUFL_POSITION              0x00000000
#define _SPI3BUFL_SPI3BUFL_MASK                  0x0000FFFF
#define _SPI3BUFL_SPI3BUFL_LENGTH                0x00000010

#define _SPI3BUFL_DATA_POSITION                  0x00000000
#define _SPI3BUFL_DATA_MASK                      0x0000FFFF
#define _SPI3BUFL_DATA_LENGTH                    0x00000010

#define _SPI3BUFH_SPI3BUFH_POSITION              0x00000000
#define _SPI3BUFH_SPI3BUFH_MASK                  0x0000FFFF
#define _SPI3BUFH_SPI3BUFH_LENGTH                0x00000010

#define _SPI3BUFH_DATA_POSITION                  0x00000000
#define _SPI3BUFH_DATA_MASK                      0x0000FFFF
#define _SPI3BUFH_DATA_LENGTH                    0x00000010

#define _SPI3BRGL_SPI3BRGL_POSITION              0x00000000
#define _SPI3BRGL_SPI3BRGL_MASK                  0x00001FFF
#define _SPI3BRGL_SPI3BRGL_LENGTH                0x0000000D

#define _SPI3BRGL_BRG_POSITION                   0x00000000
#define _SPI3BRGL_BRG_MASK                       0x00001FFF
#define _SPI3BRGL_BRG_LENGTH                     0x0000000D

#define _SPI3IMSK1_SPIRBFEN_POSITION             0x00000000
#define _SPI3IMSK1_SPIRBFEN_MASK                 0x00000001
#define _SPI3IMSK1_SPIRBFEN_LENGTH               0x00000001

#define _SPI3IMSK1_SPITBFEN_POSITION             0x00000001
#define _SPI3IMSK1_SPITBFEN_MASK                 0x00000002
#define _SPI3IMSK1_SPITBFEN_LENGTH               0x00000001

